# Rebar Shape Rebar Shape Matches Curves And Terminations Data Method

Source: https://www.revitapidocs.com/2026/3902cca7-5188-bfb2-6e25-859a8833fb22.htm

---

| Rebar Shape Rebar Shape Matches Curves And Terminations Data Method |
| --- |

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static bool RebarShapeMatchesCurvesAndTerminationsData(
	RebarShape rebarShape,
	RebarBarType barType,
	XYZ norm,
	IList<Curve> curves,
	RebarShapeTerminationsData rebarShapeTerminationsData
)
```

```
Public Shared Function RebarShapeMatchesCurvesAndTerminationsData (
	rebarShape As RebarShape,
	barType As RebarBarType,
	norm As XYZ,
	curves As IList(Of Curve),
	rebarShapeTerminationsData As RebarShapeTerminationsData
) As Boolean
```

```
public:
static bool RebarShapeMatchesCurvesAndTerminationsData(
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	XYZ^ norm,
	IList<Curve^>^ curves,
	RebarShapeTerminationsData^ rebarShapeTerminationsData
)
```

```
static member RebarShapeMatchesCurvesAndTerminationsData :
        rebarShape : RebarShape *
        barType : RebarBarType *
        norm : XYZ *
        curves : IList<Curve> *
        rebarShapeTerminationsData : RebarShapeTerminationsData -> bool
```

#### Parameters

rebarShape RebarShape
barType RebarBarType
norm XYZ
curves IList Curve
rebarShapeTerminationsData RebarShapeTerminationsData

#### Return Value

Boolean See Also

#### Reference

RebarShape Class Autodesk.Revit.DB.Structure Namespace